MEMBER = ['박연수', '권세한', '권하은', '박지은', '박하은', '손하진', '송호석', '이신후', '이준수', '임혁규']
START_DATE = '2024-02-19'
END_DATE = '2024-04-26'

pattern_set = r'\d{4}\s?\w+\s?설정' # 설정 정규식
pattern_success = r'\d{4}\s?\w+\s?성공' # 성공 정규식
pattern_fail = r'\d{4}\s?\w+\s?실패' # 실패 정규식
pattern_off = r'\d{4}\s?\w+\s?.*?\s?off' # off 정규식
pattern_offs = r'\d{4}-\d{4}\s?\w+\s?.*?\s?off' # offs 정규식
pattern_retry_set = r'\d{4}\s?\w+\s?\d{4}\s?재도전' # 재도전 설정 정규식
pattern_retry_sucess = r'\d{4}\s?\w+\s?\d{4}\s?재성공' # 재도전 인증 정규식
pattern_time = r'\d{4}\s?'


박연수_벌금 = sum([3_000,15_000,20_000,-4000]) 
권세한_벌금 = sum([6_000,9_000,3_000,7_000,11_000])
권하은_벌금 = sum([9_000,53_000])
박지은_벌금 = sum([21_000,9_000,6_000,4_000,18_000,6000,9_000])
박하은_벌금 = sum([9_000,12_000,10_000, 3_000,8_000,14_000, -8_000])
손하진_벌금 = sum([56_000,72_000])
송호석_벌금 = sum([33_000])
이신후_벌금 = sum([3_000,31_000,14_000, -3000])
이준수_벌금 = sum([21_000, 24_000, -5000])
임혁규_벌금 = sum([2_000, 12_000, 8_000])